uhnp/src/Catalogs/НастройкиСчетовУчетаПрочихОпераций/НастройкиСчетовУчетаПрочихОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиСчетовУчетаПрочихОпераций</name>
  <comment>Настройки счетов учета прочих операций</comment>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецНастройки</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
      <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
      <types>DocumentRef.ЗаписьКнигиПокупок</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеУслугПоАренде</types>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.Бронирование</types>
      <types>DocumentRef.НачислениеОценочныхОбязательствПоОтпускам</types>
      <types>DocumentRef.СписаниеОС2_4</types>
      <types>DocumentRef.РаспределениеПроизводственныхЗатрат</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.АктПремииКлиенту</types>
      <types>DocumentRef.ВозвратОСИзАренды2_4</types>
      <types>DocumentRef.АктВыполненныхВнутреннихРабот</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ПеремещениеОС2_4</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
      <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
      <types>DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</types>
      <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПринятиеКУчетуНМА2_4</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ПеремещениеНМА2_4</types>
      <types>DocumentRef.АмортизацияНМА2_4</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.СписаниеНМА2_4</types>
      <types>DocumentRef.РаспределениеВозвратныхОтходов</types>
      <types>DocumentRef.ПринятиеКУчетуОС2_4</types>
      <types>DocumentRef.КорректировкаСтоимостиИАмортизацииОС</types>
      <types>DocumentRef.КорректировкаЗадолженности</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ОтчетОСписанииТоваровСХранения</types>
      <types>DocumentRef.ОтчетОСписанииТоваровУХранителя</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
      <types>DocumentRef.АмортизацияОС2_4</types>
      <types>DocumentRef.ПринятиеКУчетуУзловКомпонентовАмортизации</types>
      <types>DocumentRef.ВзаимозачетЗадолженности</types>
      <types>DocumentRef.ДепонированиеЗарплаты</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.КорректировкаСтоимостиИАмортизацииНМА</types>
      <types>DocumentRef.ЗаписьКнигиПродаж</types>
      <types>DocumentRef.ОтчетПереработчика2_5</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете2_5</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиМеждународногоУчета</name>
    <attributes>
      <name>ПланСчетов</name>
      <type>
        <types>CatalogRef.ПланыСчетовМеждународногоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/НастройкиСчетовУчетаПрочихОпераций/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = НастройкаСчетовУчетаКлиентСервер.ПредставлениеНастройкиОтражения(ЭтотОбъект, Неопределено, Неопределено);
	
	Если НЕ ЗначениеЗаполнено(ВладелецНастройки) Тогда
		ВладелецНастройки = Неопределено;
	КонецЕсли;
	
	ХешСумма = ХешСуммаНастройкиСчетов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ХешСуммаНастройкиСчетов()
	
	ДанныеХешСуммы = Новый Массив();
	
	//++ Локализация
	Если ЗначениеЗаполнено(СчетУчета) Тогда
		ДобавитьСчетИСубконтоВДанныеХешСуммы(ЭтотОбъект, ДанныеХешСуммы);
	КонецЕсли;
	//-- Локализация
	
	//++ НЕ УТКА
	НастройкиМУ = Новый ТаблицаЗначений();
	НастройкиМУ.Колонки.Добавить("ПланСчетов", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	НастройкиМУ.Колонки.Добавить("СчетУчета", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	НастройкиМУ.Колонки.Добавить("Субконто1");
	НастройкиМУ.Колонки.Добавить("Субконто2");
	НастройкиМУ.Колонки.Добавить("Субконто3");
	
	Для Каждого МеждународнаяНастройка Из НастройкиМеждународногоУчета Цикл
		Если ЗначениеЗаполнено(МеждународнаяНастройка.СчетУчета) Тогда
			НоваяСтрока = НастройкиМУ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, МеждународнаяНастройка, "Субконто1,Субконто2,Субконто3");
			НоваяСтрока.ПланСчетов = XMLСтрока(МеждународнаяНастройка.ПланСчетов);
			НоваяСтрока.СчетУчета = XMLСтрока(МеждународнаяНастройка.СчетУчета);
		КонецЕсли;
	КонецЦикла;

	НастройкиМУ.Сортировать("ПланСчетов,СчетУчета");
	
	Для Каждого НастройкаМУ Из НастройкиМУ Цикл
		ДанныеХешСуммы.Добавить(НастройкаМУ.ПланСчетов);
		ДобавитьСчетИСубконтоВДанныеХешСуммы(НастройкаМУ, ДанныеХешСуммы);
	КонецЦикла;
	//-- НЕ УТКА
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешированиеДанных.Добавить(СтрСоединить(ДанныеХешСуммы));
	
	Возврат Base64Строка(ХешированиеДанных.ХешСумма);
	
КонецФункции

Процедура ДобавитьСчетИСубконтоВДанныеХешСуммы(ДанныеНастройки, ДанныеХешСуммы)
	
	ДанныеХешСуммы.Добавить(XMLСтрока(ДанныеНастройки.СчетУчета));
	
	Если ЗначениеЗаполнено(ДанныеНастройки.Субконто1) Тогда
		ДанныеХешСуммы.Добавить(XMLСтрока(ДанныеНастройки.Субконто1));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеНастройки.Субконто2) Тогда
		ДанныеХешСуммы.Добавить(XMLСтрока(ДанныеНастройки.Субконто2));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеНастройки.Субконто3) Тогда
		ДанныеХешСуммы.Добавить(XMLСтрока(ДанныеНастройки.Субконто3));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
